lvx/base/Enums/бит_ВидыОперацийКазначейства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацийКазначейства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутренняяПередачаДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствВДругуюОрганизацию</Name>
					<Comment>Для наличных и безналичных расчетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствВДругуюКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыНаЛицевыеСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыПоЗарплатномуПроекту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыРаботнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыРаздатчиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыЧерезКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыНаПлатежнуюКарту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнкассацияДенежныхСредствИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонвертацияВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаАрендодателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаДенежныхСредствВДругуюОрганизацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеДенежныхСредствНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНаДепозиты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеТаможне</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеДенежныхСредствИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочаяВыдачаДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаДенежныхСредствВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнкассацияДенежныхСредствВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеВБюджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеДенежныхСредствИзДругойОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствОтДругойОрганизации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/CommonModules/бит_КазначействоКлиентСервер/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ВозможноВзысканиеСПеречисленияФизлицу(Дата, ВидОперации, КонтрагентЮрФизЛицо = Неопределено) Экспорт
	
	// См. ОМ.СписаниеБезналичныхДенежныхСредствЛокализация.ЗаполнитьНастройкиПолейФормы().
	// Область "Код вида дохода".
	
	Результат = Ложь;
	
	ПеречислениеСотруднику =
		ВидОперации = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту");
		
	ПеречислениеПодотчетномуЛицу =
		ВидОперации = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику");
		
	ВыплатыКонтрагентам =
		ВидОперации = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОплатаПоставщику");
		
	ДействуетУказание2019_5286У = ПлатежиВБюджетКлиентСервер.ДействуетУказание2019_5286У(Дата);
	
	Если (ПеречислениеСотруднику ИЛИ ПеречислениеПодотчетномуЛицу ИЛИ ВыплатыКонтрагентам) И ДействуетУказание2019_5286У Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура КодВидаДоходаПоУмолчанию(Объект, ВидОперации, КонтрагентЮрФизЛицо) Экспорт
		
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета")
		И Объект.КодВидаДохода = "" Тогда
		Объект.КодВидаДохода = "1";
	КонецЕсли;

КонецПроцедуры

Функция ЭтоДокументПоступленияДС(Данные) Экспорт
	
	ЭтоПоступлениеДС = Ложь;
	
	ДокументыПоступления = Новый Массив;
	ДокументыПоступления.Добавить(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"));
	ДокументыПоступления.Добавить(Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств"));
	
	Если НЕ ДокументыПоступления.Найти(ТипЗнч(Данные)) = Неопределено Тогда
		ЭтоПоступлениеДС = Истина;
	КонецЕсли; 
	
	Возврат ЭтоПоступлениеДС;
	
КонецФункции

Функция ЭтоДокументРасходованияДС(Данные) Экспорт
	
	ЭтоРасходованиеДС = Ложь;
	
	ДокументыРасходования = Новый Массив;
	ДокументыРасходования.Добавить(Тип("ДокументСсылка.РасходныйКассовыйОрдер"));
	ДокументыРасходования.Добавить(Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств"));
	
	Если НЕ ДокументыРасходования.Найти(ТипЗнч(Данные)) = Неопределено Тогда
		ЭтоРасходованиеДС = Истина;
	КонецЕсли; 
	
	Возврат ЭтоРасходованиеДС;
	
КонецФункции

Функция ПериодЗаданКорректно(Объект, Параметры)  Экспорт

	ДатаКорректна = Истина;

	ДатаНачала 	  = Параметры.ПоляОбъекта.ДатаНачала;
	ДатаОкончания = Параметры.ПоляОбъекта.ДатаОкончания;
		
	ПолеДатаНачала 	  = Параметры.ПоляФормы.ДатаНачала;
	ПолеДатаОкончания = Параметры.ПоляФормы.ДатаОкончания;
	Префикс 		  = Параметры.ПоляФормы.Префикс;
	ИмяСписка		  = Параметры.ПоляФормы.ИмяСписка;
	НомерСтроки		  = Параметры.ПоляФормы.НомерСтроки;
	
	ВыводитьСообщения = Параметры.ВыводитьСообщения;

	Если НЕ ЗначениеЗаполнено(Объект[ДатаОкончания]) Тогда
		Возврат ДатаКорректна;	
	КонецЕсли;
	
	ЗначениеНачало 	  = НачалоДня(Объект[ДатаНачала]);
	ЗначениеОкончание = НачалоДня(Объект[ДатаОкончания]);
	
	ДатаКорректна = (ЗначениеНачало <= ЗначениеОкончание);
	
	Если НЕ ДатаКорректна И ВыводитьСообщения Тогда
		
		Дополнение = НСтр("ru = '""%1"" не может быть ранее ""%2"".'; en = '""%1"" cannot be earlier than ""%2""'");
		Дополнение = СтрШаблон(Дополнение, ПолеДатаОкончания, ПолеДатаНачала);
		
		Если ЗначениеЗаполнено(ИмяСписка) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка","Корректность", ПолеДатаОкончания, 
								НомерСтроки, ИмяСписка, Дополнение);
		Иначе	
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,"Корректность", ПолеДатаОкончания,,,Дополнение);
		КонецЕсли;
		
		ПутьКДанным = "";
		Если ЗначениеЗаполнено(Префикс) И ЗначениеЗаполнено(НомерСтроки) Тогда
			ПутьКДанным = Префикс + "[%1].";
			ПутьКДанным = СтрШаблон(ПутьКДанным, Формат(НомерСтроки - 1, "ЧН=0; ЧГ="));
		ИначеЕсли ЗначениеЗаполнено(Префикс) Тогда
			ПутьКДанным = Префикс + ".";
		КонецЕсли;
		ПутьКДанным = ПутьКДанным + ДатаОкончания;
		
		#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , ПутьКДанным,);
		#Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , ПутьКДанным,);
		#КонецЕсли	
	КонецЕсли; 
	
	Возврат ДатаКорректна;

КонецФункции

Функция НовыеПараметрыПериодЗаданКорректно() Экспорт

	// Имена полей объета с данными.
	ПоляОбъекта = Новый Структура;	
	ПоляОбъекта.Вставить("ДатаНачала",	  "Дата");
	ПоляОбъекта.Вставить("ДатаОкончания", "ДатаПлан");
	
	// Представление полей объекта (колонок) и списка.
	ПоляФормы = Новый Структура;
	ПоляФормы.Вставить("ДатаНачала",	НСтр("ru = 'Дата документа'"));
	ПоляФормы.Вставить("ДатаОкончания", НСтр("ru = 'Дата расхода'"));
	ПоляФормы.Вставить("ИмяСписка",     "");
	
	// Элементы пути к данным, пригодные для формирования сообщения пользователю.
	ПоляФормы.Вставить("НомерСтроки", 	0);
	ПоляФормы.Вставить("Префикс",     	"Объект");
	
	Параметры = Новый Структура;
	Параметры.Вставить("ПоляОбъекта",	  	ПоляОбъекта);
	Параметры.Вставить("ПоляФормы", 		ПоляФормы);
	Параметры.Вставить("ВыводитьСообщения", Истина);
	
	Возврат Параметры;
	
КонецФункции

Функция НаборХозяйственныхОпераций() Экспорт

	ВидыОпераций = Новый Соответствие; 
	
	ВнутренняяПередачаДенежныхСредств 		  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств");
	ВозвратДенежныхСредствВДругуюОрганизацию  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию");
	ВозвратОплатыКлиенту 					  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту");
	ВыдачаДенежныхСредствПодотчетнику 		  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику");
	ВыдачаДенежныхСредствВДругуюКассу 		  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу");
	ВыдачаЗаймаСотруднику 					  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыдачаЗаймаСотруднику");
	ВыдачаЗаймов 							  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыдачаЗаймов");
	ВыплатаЗарплатыНаЛицевыеСчета 			  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета");
	ВыплатаЗарплатыПоЗарплатномуПроекту 	  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту");
	ВыплатаЗарплатыРаботнику 				  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыРаботнику");
	ВыплатаЗарплатыРаздатчиком 				  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыРаздатчиком");
	ВыплатаЗарплатыЧерезКассу 				  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыЧерезКассу");
	ИнкассацияДенежныхСредствИзБанка 		  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ИнкассацияДенежныхСредствИзБанка");
	КонвертацияВалюты 						  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.КонвертацияВалюты");
	ОплатаДенежныхСредствВДругуюОрганизацию   = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию");
	ОплатаПоКредитам 						  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОплатаПоКредитам");
	ОплатаПоставщику 						  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОплатаПоставщику");
	ПеречислениеДенежныхСредствНаДругойСчет   = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет");
	ПеречислениеНаДепозиты					  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПеречислениеНаДепозиты");
	ПеречислениеТаможне 					  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПеречислениеТаможне");
	ПоступлениеДенежныхСредствИзБанка 		  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзБанка");
	ПоступлениеОплатыОтКлиента 				  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента");
	ПрочаяВыдачаДенежныхСредств 			  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств");
	СдачаДенежныхСредствВБанк 				  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.СдачаДенежныхСредствВБанк");
	ИнкассацияДенежныхСредствВБанк 			  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ИнкассацияДенежныхСредствВБанк");
	ПеречислениеВБюджет						  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПеречислениеВБюджет");
	ВозвратОплатыНаПлатежнуюКарту			  = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту");
	ВозвратДенежныхСредствОтДругойОрганизации = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтДругойОрганизации");
	
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ОплатаПоставщику"), ОплатаПоставщику);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВозвратОплатыКлиенту"), ВозвратОплатыКлиенту);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеТаможне"), ПеречислениеТаможне);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыНаЛицевыеСчета"), ВыплатаЗарплатыНаЛицевыеСчета);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПрочаяВыдачаДенежныхСредств"), ПрочаяВыдачаДенежныхСредств);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыдачаЗаймов"), ВыдачаЗаймов);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВнутренняяПередачаДенежныхСредств"), ВнутренняяПередачаДенежныхСредств);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВозвратДенежныхСредствВДругуюОрганизацию"), ВозвратДенежныхСредствВДругуюОрганизацию);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыдачаДенежныхСредствВДругуюКассу"), ВыдачаДенежныхСредствВДругуюКассу);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыдачаДенежныхСредствПодотчетнику"), ВыдачаДенежныхСредствПодотчетнику);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыдачаЗаймаСотруднику"), ВыдачаЗаймаСотруднику);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыПоЗарплатномуПроекту"), ВыплатаЗарплатыПоЗарплатномуПроекту);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыРаботнику"), ВыплатаЗарплатыРаботнику);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыРаздатчиком"), ВыплатаЗарплатыРаздатчиком);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыЧерезКассу"), ВыплатаЗарплатыЧерезКассу);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ИнкассацияДенежныхСредствИзБанка"), ИнкассацияДенежныхСредствИзБанка);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.КонвертацияВалюты"), КонвертацияВалюты);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ОплатаДенежныхСредствВДругуюОрганизацию"), ОплатаДенежныхСредствВДругуюОрганизацию);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ОплатаПоКредитам"), ОплатаПоКредитам);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеДенежныхСредствНаДругойСчет"), ПеречислениеДенежныхСредствНаДругойСчет);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеНаДепозиты"), ПеречислениеНаДепозиты);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПоступлениеДенежныхСредствИзБанка"), ПоступлениеДенежныхСредствИзБанка);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПоступлениеОплатыОтКлиента"), ПоступлениеОплатыОтКлиента);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.СдачаДенежныхСредствВБанк"), СдачаДенежныхСредствВБанк);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ИнкассацияДенежныхСредствВБанк"), ИнкассацияДенежныхСредствВБанк);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеВБюджет"), ПеречислениеВБюджет);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВозвратОплатыНаПлатежнуюКарту"), ВозвратОплатыНаПлатежнуюКарту);
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВозвратДенежныхСредствОтДругойОрганизации"), ВозвратДенежныхСредствОтДругойОрганизации);
	
	бит_КазначействоКлиентСерверПереопределяемый.ДополнитьНаборХозяйственныхОпераций(ВидыОпераций);
	
	Возврат ВидыОпераций;
	
КонецФункции

Функция ХозяйственнаяОперацияУП(ВидОперации) Экспорт

	ВидыОпераций = НаборХозяйственныхОпераций();
	Возврат ВидыОпераций[ВидОперации];
	
КонецФункции

Функция ХозяйственнаяОперацияБФ(ВидОперации) Экспорт

	ХозяйственнаяОперацияБФ = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПустаяСсылка");
	
	ВидыОпераций = НаборХозяйственныхОпераций();
	Для каждого КлючЗначение Из ВидыОпераций Цикл
		Если КлючЗначение.Значение = ВидОперации Тогда
			ХозяйственнаяОперацияБФ = КлючЗначение.Ключ;
			Прервать;
		КонецЕсли;
	КонецЦикла; 
	
	Возврат ХозяйственнаяОперацияБФ;

КонецФункции

Функция ОперацияБезНДС(ВидОперации) Экспорт
	
	ОперацииБезНДС = ОперацииБезНДС();
	Возврат ОперацииБезНДС.Найти(ВидОперации) <> Неопределено;
	
КонецФункции

Функция ВидыОперацийСНаличными() Экспорт

	ВидыОпераций  = Новый Массив; 
	НаборОпераций = НаборХозяйственныхОпераций();
	Для каждого КлючЗначение Из НаборОпераций Цикл
		ВидыОпераций.Добавить(КлючЗначение.Ключ);	
	КонецЦикла; 
	
	ВидыОпераций = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ВидыОпераций, ОперацииТолькоПоБанку());
	
	Возврат ВидыОпераций;
	
КонецФункции

Функция ВидыОперацийПоБанку() Экспорт
	
	ВидыОпераций  = Новый Массив; 
	НаборОпераций = НаборХозяйственныхОпераций();
	Для каждого КлючЗначение Из НаборОпераций Цикл
		ВидыОпераций.Добавить(КлючЗначение.Ключ);	
	КонецЦикла; 
	
	ВидыОпераций = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ВидыОпераций, ОперацииТолькоСНаличными());
	
	Возврат ВидыОпераций;
	
КонецФункции

Функция ВидыОперацийЗаявкаНаПеремещение() Экспорт

	ВидыОпераций = Новый Массив; 
	
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыдачаДенежныхСредствВДругуюКассу"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.СдачаДенежныхСредствВБанк"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеДенежныхСредствНаДругойСчет"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПоступлениеДенежныхСредствИзБанка"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ИнкассацияДенежныхСредствИзБанка"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ИнкассацияДенежныхСредствВБанк"));
	
	Возврат ВидыОпераций;
	
КонецФункции

Функция ВидыОперацийЗаявкаНаПереводСредств() Экспорт
	
	ВидыОпераций = ОперацииПередачиДС();
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВозвратДенежныхСредствОтДругойОрганизации"));	
	
	Возврат ВидыОпераций;
	
КонецФункции

Функция ВидыОперацийЗаявкиНаРасходованиеСредств() Экспорт

	ВидыОпераций  = Новый Массив; 
	НаборОпераций = НаборХозяйственныхОпераций();
	Для каждого КлючЗначение Из НаборОпераций Цикл
		ВидыОпераций.Добавить(КлючЗначение.Ключ);	
	КонецЦикла; 
	
	ВидыОпераций = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ВидыОпераций, ВидыОперацийЗаявкаНаПеремещение());
	ВидыОпераций = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ВидыОпераций, ВидыОперацийПоступленияДС());
	
	Возврат ВидыОпераций;
	
КонецФункции

Функция ВидыОперацийДополнительныеУсловияПоДоговору() Экспорт

	ВидыОпераций = Новый Массив; 
	
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ОплатаПоставщику"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ОплатаАрендодателю"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ОплатаПоКредитам"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеНаДепозиты"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеТаможне"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВозвратОплатыКлиенту"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыдачаЗаймов"));
	
	Возврат ВидыОпераций;
	
КонецФункции

Функция ВидыОперацийПоступленияДС() Экспорт

	ВидыОпераций = Новый Массив; 
	
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПоступлениеДенежныхСредствИзБанка"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПоступлениеОплатыОтКлиента"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВозвратДенежныхСредствОтДругойОрганизации"));
	
	Возврат ВидыОпераций;
	
КонецФункции
 
Функция ПодготовитьПараметрыВидимости(ВидОперации) Экспорт

	ОперацииСКонтрагентами = ОперацииСКонтрагентами().Найти(ВидОперации) <> Неопределено;
	ОперацииСДоговорами	   = ОперацииСДоговорами().Найти(ВидОперации) <> Неопределено;
	ОперацииСФизЛицами	   = ОперацииСФизЛицами().Найти(ВидОперации) <> Неопределено;
	ОперацииПередачиДС 	   = ОперацииПередачиДС().Найти(ВидОперации) <> Неопределено;
	ЕстьОбъектРасчетов	   = ОперацииСОбъектомРасчетов().Найти(ВидОперации) <> Неопределено;
	ЕстьПартнер			   = ОперацииСПартнерами().Найти(ВидОперации) <> Неопределено;
	
	Результат = Новый Структура();
	Результат.Вставить("ЕстьКонтрагент",	 ОперацииСКонтрагентами ИЛИ ОперацииСДоговорами);
	Результат.Вставить("ЕстьДоговор",		 ОперацииСДоговорами);
	Результат.Вставить("ФизЛицо",			 ОперацииСФизЛицами);
	Результат.Вставить("ЕстьОбъектРасчетов", ЕстьОбъектРасчетов);
	Результат.Вставить("ЕстьПартнер",		 ЕстьПартнер);
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоОперацияВыплатыЗарплаты(ВидОперации) Экспорт

	Операции = ОперацииВыплатыЗарплаты();
	Возврат Операции.Найти(ВидОперации) <> Неопределено;

КонецФункции

Функция ЭтоОперацияБезРасшифровкиПлатежа(ВидОперации) Экспорт

	Операции = ОперацияБезРасшифровкиПлатежа();
	Возврат Операции.Найти(ВидОперации) <> Неопределено;

КонецФункции

Функция ЭтоРасчетыСФизЛицами(ВидОперации) Экспорт

	Операции = ОперацииСФизЛицами();
	Возврат Операции.Найти(ВидОперации) <> Неопределено;	

КонецФункции

Функция ЭтоОперацияПередачиДенег(ВидОперации) Экспорт

	Операции = ОперацииПередачиДС();
	Возврат Операции.Найти(ВидОперации) <> Неопределено

КонецФункции

Функция ЭтоОперацияБезВалютыВзаиморасчетов(ВидОперации) Экспорт

	Операции = ОперацииБезВалютыВзаиморасчетов();
	Возврат Операции.Найти(ВидОперации) <> Неопределено

КонецФункции

Функция ЭтоОперацияСПартнером(ВидОперации) Экспорт

	Операции = ОперацииСПартнерами();
	Возврат Операции.Найти(ВидОперации) <> Неопределено

КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ОперацияБезРасшифровкиПлатежа()
	
	ВидыОпераций = Новый Массив;
	
	// См. Документы.СписаниеБезналичныхДенежныхСредств.МассивОперацийБезРасшифровкиПлатежа();
	// См. так же: бит_ОбщегоНазначенияПереопределяемый.ЕстьРасшифровкаПлатежа().
	
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВнутренняяПередачаДенежныхСредств"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.КонвертацияВалюты"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВозвратОплатыНаПлатежнуюКарту"));
	
	ИспользоватьКадровыйУчет = бит_КазначействоВызовСервера.ИспользоватьКадровыйУчет();
	Если НЕ ИспользоватьКадровыйУчет Тогда
		ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыПоЗарплатномуПроекту"));
	КонецЕсли;

	Возврат ВидыОпераций;
	
КонецФункции
 
Функция ОперацииБезНДС()

	ОперацииБезНДС = Новый Массив; 	
	
	ОперацииБезНДС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВнутренняяПередачаДенежныхСредств"));
	ОперацииБезНДС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыдачаДенежныхСредствВДругуюКассу"));
	ОперацииБезНДС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыдачаДенежныхСредствПодотчетнику"));
	ОперацииБезНДС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыдачаЗаймаСотруднику"));
	ОперацииБезНДС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыдачаЗаймов"));
	ОперацииБезНДС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыНаЛицевыеСчета"));
	ОперацииБезНДС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыПоЗарплатномуПроекту"));
	ОперацииБезНДС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыРаботнику"));
	ОперацииБезНДС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыРаздатчиком"));
	ОперацииБезНДС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыЧерезКассу"));
	ОперацииБезНДС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ИнкассацияДенежныхСредствИзБанка"));
	ОперацииБезНДС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.КонвертацияВалюты"));
	ОперацииБезНДС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ОплатаПоКредитам"));
	ОперацииБезНДС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеДенежныхСредствНаДругойСчет"));
	ОперацииБезНДС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеНаДепозиты"));
	ОперацииБезНДС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеТаможне"));
	ОперацииБезНДС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПоступлениеДенежныхСредствИзБанка"));
	ОперацииБезНДС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПрочаяВыдачаДенежныхСредств"));
	ОперацииБезНДС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.СдачаДенежныхСредствВБанк"));
	ОперацииБезНДС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеВБюджет"));
	ОперацииБезНДС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВозвратОплатыНаПлатежнуюКарту"));
	ОперацииБезНДС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ИнкассацияДенежныхСредствВБанк"));
	ОперацииБезНДС.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПоступлениеДенежныхСредствИзДругойОрганизации"));
	// Не вошедшие в наше перечисление:
	// ПоступлениеОплатыПоПлатежнойКарте, ПоступлениеДенежныхСредствСДругогоСчета,
	// ПоступлениеДенежныхСредствИзКассыНаРасчетныйСчет, ПоступлениеДенежныхСредствПоКредитам,
	// ПоступлениеДенежныхСредствПоДепозитам, ПоступлениеДенежныхСредствПоЗаймамВыданным,
	// ПогашениеЗаймаСотрудником, ВозвратДенежныхСредствОтПодотчетника,
	// ВозвратДенежныхСредствОтАрендодателя, ВозвратНеперечисленныхДС,
	// ВозвратНеперечисленнойЗарплатыПоЗарплатномуПроекту
	
	Возврат ОперацииБезНДС;

КонецФункции

Функция ОперацииТолькоСНаличными()

	ВидыОпераций = Новый Массив;
	
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыРаздатчиком"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыЧерезКассу"));
	
	Возврат ВидыОпераций;

КонецФункции

Функция ОперацииТолькоПоБанку()

	ВидыОпераций = Новый Массив; 
	
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыПоЗарплатномуПроекту"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыНаЛицевыеСчета"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеНаДепозиты"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеВБюджет"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеТаможне"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВозвратОплатыНаПлатежнуюКарту"));

	Возврат ВидыОпераций;
	
КонецФункции

Функция ОперацииСКонтрагентами()

	ВидыОпераций = Новый Массив;
	
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.КонвертацияВалюты"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыПоЗарплатномуПроекту"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеВБюджет"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПрочаяВыдачаДенежныхСредств"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыдачаЗаймов"));
	
	Возврат ВидыОпераций;
	
КонецФункции

Функция ОперацииСДоговорами()

	ВидыОпераций = Новый Массив;
	
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ОплатаАрендодателю"));	
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ОплатаПоставщику"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВозвратОплатыКлиенту"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеТаможне"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ОплатаПоКредитам"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеНаДепозиты"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПоступлениеОплатыОтКлиента"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВозвратОплатыНаПлатежнуюКарту"));
	
	Возврат ВидыОпераций;
	
КонецФункции

Функция ОперацииСФизЛицами()

	ВидыОпераций = Новый Массив;
	
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыдачаДенежныхСредствПодотчетнику"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыНаЛицевыеСчета"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыРаздатчиком"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыРаботнику"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыдачаЗаймаСотруднику"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыЧерезКассу"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВозвратОплатыНаПлатежнуюКарту"));
	
	Возврат ВидыОпераций;
	
КонецФункции 

Функция ОперацииПередачиДС()

	ВидыОпераций = Новый Массив;
	
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВнутренняяПередачаДенежныхСредств"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВозвратДенежныхСредствВДругуюОрганизацию"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ОплатаДенежныхСредствВДругуюОрганизацию"));
	
	Возврат ВидыОпераций;
	
КонецФункции

Функция ОперацииСОбъектомРасчетов()

	ВидыОпераций = ОперацииСДоговорами();
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВозвратДенежныхСредствВДругуюОрганизацию"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ОплатаДенежныхСредствВДругуюОрганизацию"));	

	ВычитаемыеВиды = Новый Массив;
	ВычитаемыеВиды.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеНаДепозиты"));
	ВычитаемыеВиды.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ОплатаПоКредитам"));
	ВычитаемыеВиды.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеНаДепозиты"));
	ВычитаемыеВиды.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыдачаЗаймов"));
	ВычитаемыеВиды.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ОплатаАрендодателю"));
	ВычитаемыеВиды.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВозвратОплатыНаПлатежнуюКарту"));
	
	Возврат ОбщегоНазначенияКлиентСервер.РазностьМассивов(ВидыОпераций, ВычитаемыеВиды);
	
КонецФункции

Функция ОперацииВыплатыЗарплаты()

	ВидыОпераций = Новый Массив; 
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыПоЗарплатномуПроекту"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыНаЛицевыеСчета"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыЧерезКассу"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыРаздатчиком"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыРаботнику"));

	Возврат ВидыОпераций;
	
КонецФункции

Функция ОперацииБезВалютыВзаиморасчетов()

	ВидыОпераций = ОперацииВыплатыЗарплаты();
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВнутренняяПередачаДенежныхСредств"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеДенежныхСредствНаДругойСчет"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ИнкассацияДенежныхСредствИзБанка"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ИнкассацияДенежныхСредствВБанк"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыдачаЗаймаСотруднику"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.КонвертацияВалюты"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.СдачаДенежныхСредствВБанк"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыдачаДенежныхСредствВДругуюКассу"));
	
	Возврат ВидыОпераций;
	
КонецФункции

Функция ОперацииСПартнерами()

	ВидыОпераций = Новый Массив;
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ОплатаПоставщику"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеТаможне"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ОплатаАрендодателю"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ОплатаПоКредитам"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеНаДепозиты"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыдачаЗаймов"));
	ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВозвратОплатыКлиенту"));
	
	Возврат ВидыОпераций;
	
КонецФункции

#КонецОбласти
